In [4]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
#code to create a series
s = pd.Series([1,2,3,4,5,6,np.nan,7,8,9,10])
s

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      NaN
7      7.0
8      8.0
9      9.0
10    10.0
dtype: float64

In [6]:
dict = {'G': ['A','A','A','B'],
        'A':[1, 4, 6, 9], 
        'B':[np.NaN, 5, 8, np.NaN], 
        'C':[7, 3, np.NaN, 2],
        'D':[1, np.NaN, np.NaN, np.NaN] } 
  
# creating dataframe from the
# dictionary 
data = pd.DataFrame(dict) 
data

   G  A    B    C    D
0  A  1  NaN  7.0  1.0
1  A  4  5.0  3.0  NaN
2  A  6  8.0  NaN  NaN
3  B  9  NaN  2.0  NaN

In [10]:
data.where(data[['A','B']]>0)

     G  A    B   C   D
0  NaN  1  NaN NaN NaN
1  NaN  4  5.0 NaN NaN
2  NaN  6  8.0 NaN NaN
3  NaN  9  NaN NaN NaN

In [9]:
data['G'].value_counts()

A    3
B    1
Name: G, dtype: int64

In [19]:
data.groupby("G")['B'].count()

G
A    2
B    0
Name: B, dtype: int64

In [5]:
#this is a series 
d = pd.date_range("20210408", periods=10)

In [6]:
d

DatetimeIndex(['2021-04-08', '2021-04-09', '2021-04-10', '2021-04-11',
               '2021-04-12', '2021-04-13', '2021-04-14', '2021-04-15',
               '2021-04-16', '2021-04-17'],
              dtype='datetime64[ns]', freq='D')

In [7]:
#Now we will create a dataFrame
df = pd.DataFrame(np.random.randn(10,4), index=d, columns=['A','B','C','D'])

In [8]:
df

                   A         B         C         D
2021-04-08 -1.140093 -0.846299 -0.454721  0.052045
2021-04-09  0.196391 -0.367189 -2.313300  1.604434
2021-04-10  0.295353  0.118465 -0.126702 -1.089530
2021-04-11  1.144954 -0.019178 -0.909916  1.201310
2021-04-12 -2.030637 -0.145976 -0.641746  1.545143
2021-04-13  1.399026  0.499755 -0.746623 -0.682868
2021-04-14 -0.164900  0.114371 -1.376268 -0.023701
2021-04-15  0.191488  0.191629  1.093550  1.274845
2021-04-16  0.815851 -0.673989 -0.418809  1.127514
2021-04-17 -0.490368 -0.718141  0.887755 -0.254530

In [9]:
#create a dataframe by passing dictionary of objects that can be converted into a series
df1 = pd.DataFrame({
    'A' : [1,2,3,4],
    'B' : pd.Timestamp("20210408"),
    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
    'D' : np.array([5]*4, dtype='int32'),
    'E' : pd.Categorical(['True','False','True','False']),
    'F' : 'Akanksha'
})

In [10]:
df1

   A          B    C  D      E         F
0  1 2021-04-08  1.0  5   True  Akanksha
1  2 2021-04-08  1.0  5  False  Akanksha
2  3 2021-04-08  1.0  5   True  Akanksha
3  4 2021-04-08  1.0  5  False  Akanksha

In [11]:
df1.dtypes
# the above command will print the datatypes of each column

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()
#this will give you first five rows of the dataset

                   A         B         C         D
2021-04-08 -1.140093 -0.846299 -0.454721  0.052045
2021-04-09  0.196391 -0.367189 -2.313300  1.604434
2021-04-10  0.295353  0.118465 -0.126702 -1.089530
2021-04-11  1.144954 -0.019178 -0.909916  1.201310
2021-04-12 -2.030637 -0.145976 -0.641746  1.545143

In [13]:
df.tail()
#this will give the last five rows of the dataset

                   A         B         C         D
2021-04-13  1.399026  0.499755 -0.746623 -0.682868
2021-04-14 -0.164900  0.114371 -1.376268 -0.023701
2021-04-15  0.191488  0.191629  1.093550  1.274845
2021-04-16  0.815851 -0.673989 -0.418809  1.127514
2021-04-17 -0.490368 -0.718141  0.887755 -0.254530

In [15]:
df.index
#this will return all values of our index

DatetimeIndex(['2021-04-08', '2021-04-09', '2021-04-10', '2021-04-11',
               '2021-04-12', '2021-04-13', '2021-04-14', '2021-04-15',
               '2021-04-16', '2021-04-17'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
#df.to_numpy()
#gives numpy representation of the data

In [23]:
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.021706  -0.184655  -0.500678   0.475466
std     1.042567   0.449114   0.995440   0.986695
min    -2.030637  -0.846299  -2.313300  -1.089530
25%    -0.409001  -0.597289  -0.869093  -0.196822
50%     0.193939  -0.082577  -0.548234   0.589780
75%     0.685727   0.117441  -0.199729   1.256461
max     1.399026   0.499755   1.093550   1.604434

In [25]:
#sorting
# df.sort_index(axis=1, ascending=False)
# sort by values
df.sort_values(by='C')

                   A         B         C         D
2021-04-09  0.196391 -0.367189 -2.313300  1.604434
2021-04-14 -0.164900  0.114371 -1.376268 -0.023701
2021-04-11  1.144954 -0.019178 -0.909916  1.201310
2021-04-13  1.399026  0.499755 -0.746623 -0.682868
2021-04-12 -2.030637 -0.145976 -0.641746  1.545143
2021-04-08 -1.140093 -0.846299 -0.454721  0.052045
2021-04-16  0.815851 -0.673989 -0.418809  1.127514
2021-04-10  0.295353  0.118465 -0.126702 -1.089530
2021-04-17 -0.490368 -0.718141  0.887755 -0.254530
2021-04-15  0.191488  0.191629  1.093550  1.274845

In [26]:
#fetching single column
df['C']

2021-04-08   -0.454721
2021-04-09   -2.313300
2021-04-10   -0.126702
2021-04-11   -0.909916
2021-04-12   -0.641746
2021-04-13   -0.746623
2021-04-14   -1.376268
2021-04-15    1.093550
2021-04-16   -0.418809
2021-04-17    0.887755
Freq: D, Name: C, dtype: float64

In [28]:
#slicing rows
df[0:3] #this will give 3 rows

                   A         B         C         D
2021-04-08 -1.140093 -0.846299 -0.454721  0.052045
2021-04-09  0.196391 -0.367189 -2.313300  1.604434
2021-04-10  0.295353  0.118465 -0.126702 -1.089530

In [29]:
#select data using labels
df.loc[d[0]]

A   -1.140093
B   -0.846299
C   -0.454721
D    0.052045
Name: 2021-04-08 00:00:00, dtype: float64

In [30]:
df.loc[:,['A','C']] #label slicing

                   A         C
2021-04-08 -1.140093 -0.454721
2021-04-09  0.196391 -2.313300
2021-04-10  0.295353 -0.126702
2021-04-11  1.144954 -0.909916
2021-04-12 -2.030637 -0.641746
2021-04-13  1.399026 -0.746623
2021-04-14 -0.164900 -1.376268
2021-04-15  0.191488  1.093550
2021-04-16  0.815851 -0.418809
2021-04-17 -0.490368  0.887755

In [31]:
df.loc['20210408':'20210415',['D','C']]

                   D         C
2021-04-08  0.052045 -0.454721
2021-04-09  1.604434 -2.313300
2021-04-10 -1.089530 -0.126702
2021-04-11  1.201310 -0.909916
2021-04-12  1.545143 -0.641746
2021-04-13 -0.682868 -0.746623
2021-04-14 -0.023701 -1.376268
2021-04-15  1.274845  1.093550

In [32]:
#to fetch a particular value from an exact place
df.at[d[0], 'C']

-0.4547214165355501

In [34]:
#to get all the values from third loc
# df.iloc[3]
#also we can slice these values
df.iloc[3:5]

                   A         B         C         D
2021-04-11  1.144954 -0.019178 -0.909916  1.201310
2021-04-12 -2.030637 -0.145976 -0.641746  1.545143

In [37]:
#all values df where A>0
df[df['A']>0]

                   A         B         C         D
2021-04-09  0.196391 -0.367189 -2.313300  1.604434
2021-04-10  0.295353  0.118465 -0.126702 -1.089530
2021-04-11  1.144954 -0.019178 -0.909916  1.201310
2021-04-13  1.399026  0.499755 -0.746623 -0.682868
2021-04-15  0.191488  0.191629  1.093550  1.274845
2021-04-16  0.815851 -0.673989 -0.418809  1.127514

In [38]:
df2 = df.reindex(index=d[0:4],columns=list(df.columns)+['E'])

In [41]:
df2.loc[d[0]:d[1],'E'] = 1

In [42]:
df2

                   A         B         C         D    E
2021-04-08 -1.140093 -0.846299 -0.454721  0.052045  1.0
2021-04-09  0.196391 -0.367189 -2.313300  1.604434  1.0
2021-04-10  0.295353  0.118465 -0.126702 -1.089530  NaN
2021-04-11  1.144954 -0.019178 -0.909916  1.201310  NaN

In [48]:
# df2.isnull()
df2.isnull().count()

A    4
B    4
C    4
D    4
E    4
dtype: int64

In [56]:
# drop null values
#df2.dropna()
#we can fill values as well
df2.fillna(value=2)

                   A         B         C         D    E
2021-04-08 -1.140093 -0.846299 -0.454721  0.052045  1.0
2021-04-09  0.196391 -0.367189 -2.313300  1.604434  1.0
2021-04-10  0.295353  0.118465 -0.126702 -1.089530  2.0
2021-04-11  1.144954 -0.019178 -0.909916  1.201310  2.0

In [58]:
## Pandas Operations
df.mean(1)

2021-04-08   -0.597267
2021-04-09   -0.219916
2021-04-10   -0.200604
2021-04-11    0.354292
2021-04-12   -0.318304
2021-04-13    0.117323
2021-04-14   -0.362625
2021-04-15    0.687878
2021-04-16    0.212642
2021-04-17   -0.143821
Freq: D, dtype: float64

In [92]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df.to_csv('dcps.csv')

In [124]:
delays = df['RecentDelays'].apply(pd.Series)
delays.rename(columns = lambda x : 'delay_'+str(x))
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [93]:
dcps = pd.read_csv('dcps.csv',sep=',')

In [94]:
dcps.drop('Unnamed: 0',axis=1, inplace=True)
dcps['FlightNumber']=dcps['FlightNumber'].fillna(0).apply(np.int64)

In [95]:
dcps[['From','To']] = dcps.From_To.str.split("_",expand=True)
dcps['From']=dcps.From.str.title()
dcps['To']=dcps.To.str.title()

In [132]:
dcps.iloc[[1],[1]] = 10055
dcps.iloc[[3],[1]] = 10075
for i in delays:
    dcps['delay_'+str(i+1)] = delays[i].fillna(0).apply(np.int64)
dcps.drop(['From_To','RecentDelays'],axis =1)

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23,47,0
1,10055,<Air France> (12),Madrid,Milan,0,0,0
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,0,0
4,10085,"""Swiss Air""",Brussels,London,67,32,0